Revit 2027 API
PlanViewRange.SetLevelId Method
 Set the level for a View Depth plane
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLevelId(
	PlanViewPlane planViewPlane,
	ElementId id
)
Public Sub SetLevelId (
	planViewPlane As PlanViewPlane,
	id As ElementId
)
public:
void SetLevelId(
	PlanViewPlane planViewPlane,
	ElementId^ id
)
member SetLevelId :
        planViewPlane : PlanViewPlane *
        id : ElementId -> unit
Parameters
planViewPlane PlanViewPlane
 The View Depth plane
id ElementId
 Id of the level
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PlanViewRange Class
Autodesk.Revit.DB Namespace